[
    {
        "image": "./images/BOOKI_OPCR_DOUGLAS.png",
        "title": "Booki",
        "description": "Le projet Booki consiste à créer la page d’accueil d’une agence de voyage. L’objectif est d’intégrer une maquette fournie en HTML et CSS, sans framework.Il met l’accent sur le respect des normes W3C, la sémantique et l’accessibilité.L’adaptation responsive (mobile, tablette, desktop) est une contrainte majeure.Ce projet permet d’acquérir de solides bases en intégration web et en mise en page CSS.",
        "link": "https://douglasdu87.github.io/Booki/"
    },
    {
        "image": "./images/NINA_CARDUCCI.png",
        "title": "NINA_CARDUCCI",
        "description": "Le projet Nina Carducci d’OpenClassrooms, consiste à optimiser le site vitrine d’une photographe professionnelle. Il met l’accent sur le référencement SEO, la performance web et l’accessibilité. Difficultés rencontrées. La principale difficulté est de comprendre et corriger les problèmes techniques liés au SEO (balises, métadonnées, structure sémantique). L’optimisation des performances (taille des images, scripts inutiles, chargement différé) demande une approche méthodique et des tests réguliers avec Lighthouse. Enfin, rendre le site accessible à tous (navigation clavier, lecteurs d’écran, contrastes) nécessite de respecter des normes strictes et parfois peu intuitives.",
        "link": "https://douglasdu87.github.io/NINA_CARDUCCI/"
    },
    {
        "image": "./images/mon-vieux-grimoire.png",
        "title": "Mon_vieux_grimoire",
        "description": "Le projet Mon Vieux Grimoire d’OpenClassrooms consiste à développer une API sécurisée permettant aux utilisateurs d’ajouter, modifier, supprimer et noter des livres.Il met en avant la gestion des données, la sécurité des utilisateurs et le respect des standards REST. Difficultés rencontrées : La première difficulté est la mise en place d’une authentification sécurisée avec JWT et le hashage des mots de passe. Ensuite, la gestion des images (upload, stockage, suppression) via Multer peut générer des erreurs si elle n’est pas bien configurée. Enfin, l’organisation du code en routes, modèles et contrôleurs pour garder un backend clair et maintenable demande une bonne rigueur de développement.",
        "link": "https://douglasdu87.github.io/Mon-vieux-grimoire/"
    }
]